<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"892f31b19a1ae4ce8e598d222c1154e432fbdac82c3334b5618083ba943f7b14","plan_job_ref":"Job Terraform plan #25 at https://github.com/mkuthan/stream-processing/actions/runs/7089844768","plan_hash":"c8d3351e658ff06920e6a222cf01b56baed2f2419939bb5ea0137bce3a29bb50","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-entry"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-exit"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
  + resource "google_pubsub_subscription" "vehicle-registration-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "vehicle-registration"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #25](https://github.com/mkuthan/stream-processing/actions/runs/7089844768)